#include <stdio.h>
int main(void){
    int face = 0;  //小明面朝向的方向
    int num = 0;  //计数小明回答“南”的数量
    
    
    //接收输入
    int n;
    scanf("%d", &n);
    
    int arr[n]; 
    for (int i = 0; i < n; i++){
        scanf("%d", &arr[i]);
    } //遍历数组输入数据。

    int x, y;
    scanf("%d %d", &x, &y);

    
    //预处理！
    //先看看会不会晕、什么时候晕
    int cc = 1; //晕眩计数器：有多少次重复？跟x比较
    int dizzy[n]; //晕眩启动器，确定晕眩位置
    for (int i = 0; i < n; i++){
        dizzy[i] = 0;
    } //dizzy初始化
    
    if ((x == 1) && (arr[0] != 2)){
        dizzy[0] = 1;
    } //补丁，防止x=1的情况第一次命令不晕眩

    //完善晕眩启动器的数据
    for (int i = 1; i < n; i++){ //晕眩前摇累积
        if ((arr[i] == 1) && (arr[i-1] == 1)) { //右转又右转➡️
            cc++;
        }else if ((arr[i] == 0) && (arr[i-1] == 0)){ //左转又左转⬅️
            cc++;
        }else{ //向后转或向反方向转均会打断计数
            cc = 1;
        }
        if (cc == x){
            cc = 1;
            dizzy[i] = 1; //通过dizzy数组排除只能执行最后一次晕眩的弊端
            i += y + 1; 
            /*模拟晕眩跳过y个数，保证dizzy数组和实际晕眩情况一致。
            这里多+1的意义是避免跳过y条命令后，arr[i-1]仍是眩晕触发前的命令，
            造成眩晕过程中的命令（arr[i-1]）被纳入计数*/
        }
    }
    
    
    //转圈阶段
    for (int i = 0; i < n; i++){
        switch(arr[i]){ //这段只管改变非晕眩的小明的本身状态
            case 0: 
                face += 3; //逆时针90度就是顺时针270度
                break;
            case 1:
                face++;
                break;
            case 2:
                face += 2;
                break;
            default:
                break; //这句没用，以备不时之需
        }
        if (face % 4 == 2){
            num++; //最关键的：喊“南！”
        }
        if (dizzy[i] == 1){ //晕了！
            for (int j = 0; j < y; j++){
                face += 2;
            }
            if (i + y < n){ //保证程序安全，防止i大小超过arr数组限制
                i += y; //覆盖原本动作
            }else{
                break;
            }
        }
        face %= 4; //保证程序安全，保证face不会过大溢出
    }


    //总结
    printf("%d\n", num);

    return 0;
}

/*有个问题：眩晕过程中还会喊“南”吗？眩晕结束时如果面向南，会喊“南”吗？
我默认：过程中不喊；结束也不喊*/
//如果喊怎么改：？在71行再加一个67行的if语句即可

/*
时间复杂度：O(n)
空间复杂度：O(n)

程序思路：
动态判定晕眩时机不好操作，所以选择在开始转圈前确定好包含晕眩的行动计划。因此我引入了dizzy[]
将会晕眩的时机写入dizzy之后，正式for循环转圈，每次转时修改face记录朝向并喊南
如果晕眩就跳过后面y个指令
！但是dizzy的设定稍显僵化 纯粹是预处理的功劳


关键思想：
程序安全；特殊值分类讨论；预处理

遇到的问题：
Q1:考虑不周导致的各种问题：
如 最开始使用if (arr[i] == dizzy)用命令值判断是否触发眩晕，可能混淆
如 cc初始化的值不能为0
如 题目理解错误，将向后转和向右转都视为向右
如 45行注释提及的问题
如 or的使用
如 arr长度可能不足，添加了74行的判断
A1：逐个解决
Q2:没有考虑28行的补丁


边界验证方式：
1️⃣命令数过少：
输入：
1
0
2 1
预期输出：0
2️⃣连续同方向转动，刚好触发晕眩
输入：
2
1 1
2 1
预期输出：1
3️⃣从未晕眩
输入：
4
0 1 2 0
3 2
预期输出：1
4️⃣晕眩后再次连续转动
输入：
7
1 1 1 1 1 1 1
3 1
预期输出：2

正常样例：参考题目文档
*/